[
    "Restituire le lingue dominanti dei paesi con il più alto sex_ratio (una lingua è dominante per una nazione se è parlata da > 50% della popolazione della nazione).",
    "Restituire il poverty rate delle nazioni con il maggior numero di lingue parlate.",
    "Restituire le nazioni in cui ‘English’ è una delle lingue dominanti e il cui poverty rate è maggiore strettamente del poverty rate di tutte le nazioni con name ‘USA’.",
    "Restituire le nazioni con il declino demografico più veloce (una nazione ha un declino demografico se death_rate - birth_rate > 0, e il declino è più veloce tanto più grande è la differenza death_rate - birth_rate).    ",
    "Restituire, per ogni lingua, la percentuale della popolazione mondiale che parla quella lingua. La percentuale deve essere espressa con un numero intero tra 0 e 100. Il risultato della query dovrà quindi essere composto da coppie (lingua,percentuale).",
    "Restituire, per ogni lingua, la percentuale della popolazione mondiale che parla quella lingua in nazioni che stanno vivendo un declino demografico. La percentuale deve essere espressa con un numero intero tra 0 e 100. Il risultato della query dovrà quindi essere composto da coppie (lingua,percentuale).    ",
    "Assumiamo che tutte le nazioni cessino di finanziare attività militari e decidano di ridistribuire il denaro così risparmiato ai propri cittadini equamente. Restituire il massimo, il minimo, e la media del quantitativo di denaro che verrà così assegnato a ciascun cittadino. In particolare, se ad esempio il massimo, minimo e media valgono a, b, c rispettivamente e le nazioni con valore massimo sono quelle con codice ‘A’ ‘D’, e quelle con minimo valore sono quelle con codice ‘B’, ‘C’, La risposta a questa query dovrà essere della forma: \nQuindi le nazioni con il massimo valore sono elencate in ordine alfabetico, quelle con minimo valore sono anche elencate in ordine alfabetico. Per la media non ha senso restituire alcuna nazione, e quindi avremo una sola tupla con NULL nella seconda colonna.    ",
    "Restituire le lingue ordinate (in ordine decrescente) rispetto alla media della percentuale di popolazione adulta delle nazioni in cui queste sono parlate da almeno il 25% della popolazione. Se due lingue hanno la stessa media percentuale, allora quella che precede l’altra alfabeticamente verrà inserita prima in elenco.    ",
    "Restituire le nazioni più ricche (che hanno il massimo gdp) tra quelle il cui nome inizia con ‘C’.",
    "Si consideri la lista delle nazioni ordinate per estensione geografica (area) dalla più grande alla più piccola, dove più nazioni con la stessa area vengono elencate in ordine alfabetico. L’interrogazione dovrà restituire la 15esima nazione di questa lista.    ",
    "Restituire le percentuali di popolazione anziana (dai 65 anni in su) delle nazioni con il massimo gdp.",
    "Scrivere una query che risolva la domanda 10, ma questa volta, si assuma che nella lista, se più nazioni hanno la stessa area, allora queste si trovano tutte nella stessa posizione a pari merito. Quindi, questa volta, in 15esima posizione potremmo avere più nazioni. Restituire tutte le nazioni in 15esima posizione."
]